#+startup: show2levels
#+startup: hideblocks


*** org TODO 设置
:PROPERTIES:
:ID:       835E8AB4-81B5-46FE-BCA0-E73E6B7EDDCB
:END:

注意事项
1. TODO 关键字尽量不要使用中文, 因为 =org-tag-view= 无法支持中文
2. TODO 关键字尽量不要使用 =+/-= 之类的符号,会导致 =org-tag-view= 的快捷搜索功能( =/TODO关键字= 的搜索方式)无法搜索,只能使用 =TODO = "TODO关键字"= 的搜索方式,也许转义能使用,但是我没找到转义字符时哪个
#+begin_src emacs-lisp :tangle yes
  (setq org-todo-keywords
        (quote ((sequence "TODO(t)" "IMMED(i)" "NEXT(n)" "|" "DONE(d@/!)")
                (sequence "WAITING(w@/!)" "HANGUP(h@/!)" "|" "CANCELLED(c@/!)")))
        org-use-fast-todo-selection t
        org-treat-S-cursor-todo-selection-as-state-change nil
        org-todo-state-tags-triggers      (quote (("CANCELLED" ("CANCELLED" . t))
                                                  ("WAITING" ("WAITING" . t))
                                                  ("HANGUP" ("WAITING") ("HANGUP" . t))
                                                  (done ("WAITING") ("HANGUP"))
                                                  ("TODO" ("WAITING") ("CANCELLED") ("HANGUP") ("IMMED"))
                                                  ("NEXT" ("WAITING") ("CANCELLED") ("HANGUP") ("IMMED") )
                                                  ("DONE" ("WAITING") ("CANCELLED") ("HANGUP") ("IMMED") )))

        )


  (setq org-modern-todo-faces
        (quote (("TODO"    :foreground "orange")
                ("WAITING" :background "gray"
                 :foreground "white")
                ("NEXT" :foreground "blue" :weight bold)
                ("WAITING" . warning)
                ("HANGUP" :foreground "magenta" :weight bold)
                )))
#+end_src

#+RESULTS:
: ((TODO :foreground orange) (WAITING :background gray :foreground white) (NEXT :foreground blue :weight bold) (WAITING . warning) (HANGUP :foreground magenta :weight bold))

